app/Http/Controllers/ApiController.php

select count(*) as aggregate from `follow_unfollows` where (`follower_id` = '167' and `user_id` = '167' and `type` = '0')
select count(*) as aggregate from `follow_unfollows` where (`follower_id` = '167' and `user_id` = '167' and `post_id` = '2' and `type` = '2')
---
    public function isFav($user_id, $follower_id, $post_id,$type){
     try{
        if($type == 0){
           $data = DB::table('follow_unfollows')->where(['follower_id' => $follower_id,'user_id' => $user_id , 'type' => $type])->count();
        }
        else{
              $data = DB::table('follow_unfollows')->where(['follower_id' => $follower_id , 'user_id' => $user_id, 'post_id' => $post_id,'type' => $type,])->count();

select `city_name` from `master_cities` where `id` = '1' limit 1
---
    public function getUserLocation($id){
        $location = '--';
        try{
           $locationData = DB::table('master_cities')->select('city_name')->where('id',$id)->first();

select * from `users` where (`id` = '167' and `role` = 2) limit 1
---
    public function getPhotographerProfile(Request $request){
        $validator = Validator::make($request->only('user_id'), [
            'user_id' => 'required'
        ]);

        if ($validator->fails()) {
            return response()->json(['success'=>false,'message' => $validator->messages()->first()], 200);
        }
        $response = [];
        $result = User::where(['id' => $request->user_id, 'role' => 2])->first();

select `id`, `category_name` from `user_categories` where `user_id` = '167'
---
            $response['follower_count'] = $this->getCountOfFollowerAndFollowing($type = 1 , $result->id);
            $response['following_count'] = $this->getCountOfFollowerAndFollowing($type = 2 , $result->id);
            $catresp = [];
            $categoryList = UserCategory::select('id', 'category_name')->where('user_id', $request->user_id)->get();

select `id` from `category_tables` where `sub_category_id` = 12 limit 1
---
    public function allSubCategoryList(Request $request)
    {
        $result = [];
        $response = Category::where('status', 1)->where('parent_id', '>', 0)->get();
        if($response){
            foreach ($response as $res) {
                $data['id'] = $res->id;
                $data['parent_id'] = $res->parent_id;
                $data['title'] = $res->category_name;
                $category_tables = CategoryTable::where('sub_category_id', $res->id)->first('id');

select * from `user_professionals` where `user_id` = '167'
---
    public function userProfessionalList(Request $request){
        $validator = Validator::make($request->only('user_id'), [
            'user_id' => 'required'
        ]);

        if ($validator->fails()) {
            return response()->json(['success'=>false,'message' => $validator->messages()->first()], 200);
        }
        $professionalData = UserProfessional::where('user_id', $request->user_id)->get();

select * from `user_product_images` where `product_id` = 45
---
    public function productList(Request $request){
         $validator = Validator::make($request->only('user_id'), [
            'user_id' => 'required'
        ]);
        if ($validator->fails()) {
            return response()->json(['success'=>false,'message' => $validator->messages()->first()], 200);
        }
        $result = UserSellProduc::where(['user_id' => $request->user_id])->orderBy('id', 'desc')->get();
        if(count($result) > 0){
            $resp = [];
            foreach($result as $productData){
                $response['id'] = $productData->id;
                $response['user_id'] = $productData->user_id;
                $response['product_name'] = $productData->product_name;
                $response['brand_id'] = $productData->brand_id;
                $response['brand_name'] = $productData->brand->brand_name;
                $response['model_number'] = $productData->model_number;
                $response['product_price'] = $productData->product_price;
                $response['product_condition'] = $productData->product_condition;
                $response['product_description'] = $productData->product_description;
                $response['location'] = $this->locationName($productData->location_id);
                if($productData->product_invoice != ''){
                    $response['product_invoice'] = 'uploads/product_invoice/'.$productData->product_invoice;
                }
                else{
                    $response['product_invoice'] = 'uploads/blank.pdf';
                }
                $productImage = ProductImage::where('product_id', $productData->id)->get();

select * from `user_product_images` where `product_id` = 44
---
    public function sellProductList(Request $request){
        if(!empty($request->location)){
            $result = UserSellProduc::where('status', '=', 1)
                                        ->whereRaw('FIND_IN_SET(?, location_id)', [$request->location])
                                        ->orderBy('id','desc')
                                        ->get();
        }
        else{
            $result = UserSellProduc::where('status', '=', 1)->orderBy('id','desc')->get();
        }
        if(count($result) > 0){
            $resp = [];
            foreach($result as $productData){
                $response['id'] = $productData->id;
                $response['user_id'] = $productData->user_id;
                $response['product_name'] = $productData->product_name;
                $response['brand_id'] = $productData->brand_id;
                $response['brand_name'] = $productData->brand->brand_name;
                $response['model_number'] = $productData->model_number;
                $response['product_price'] = $productData->product_price;
                $response['product_condition'] = $productData->product_condition;
                $response['product_description'] = $productData->product_description;
                $response['location'] = $this->locationName($productData->location_id);
                if($productData->product_invoice != ''){
                    $response['product_invoice'] = 'uploads/product_invoice/'.$productData->product_invoice;
                }
                else{
                    $response['product_invoice'] = 'uploads/blank.pdf';
                }
                $productImage = ProductImage::where('product_id', $productData->id)->get();

select `id`, `media_type`, `media_name` from `user_medias` where `user_id` = '167'
---
    public function userMediaList(Request $request){
         $validator = Validator::make($request->only('user_id'), [
            'user_id' => 'required'
        ]);
        if ($validator->fails()) {
            return response()->json(['success'=>false,'message' => $validator->messages()->first()], 200);
        }
        $mediaList = UserMedia::select('id', 'media_type', 'media_name')->where('user_id', $request->user_id)->get();

select `user_id` from `user_professional_table_data` group by `user_id`
select * from `users` where `id` in (139, 140, 150, 154, 165, 167, 172, 183) and `active` = 1
---
    public function liveEnquiryPhotographer(Request $request){
        $userRecord = ProfessionalTableData::groupBy('user_id')->pluck('user_id');
        $response = [];
        if(count($userRecord) > 0){
            $userList = User::whereIn('id', $userRecord)->where('active', 1)->get();

select `follow_unfollows`.`status` as `follow_status`, `follow_unfollows`.`post_id`, `master_cities`.`city_name` as `location_name`, `posts`.*, `users`.`name`, `users`.`email`, `users`.`phone`, `users`.`address`, `users`.`role`, `users`.`active`, `users`.`follower_count`, `users`.`image` as `user_image`, `posts`.`created_at` as `post_created_at` from `posts` left join `users` on `users`.`id` = `posts`.`user_id` left join `follow_unfollows` on `follow_unfollows`.`follower_id` = `posts`.`user_id` left join `follow_unfollows` as `new_follow_tb` on `new_follow_tb`.`user_id` = `posts`.`user_id` left join `master_cities` on `master_cities`.`id` = `posts`.`location` where (`follow_unfollows`.`status` = 1 or `new_follow_tb`.`status` = 1) and ((`follow_unfollows`.`user_id` = '167') or (`follow_unfollows`.`follower_id` = '167') or (`new_follow_tb`.`user_id` = '167') or (`new_follow_tb`.`follower_id` = '167')) or `posts`.`user_id` = '167' group by `posts`.`id` order by `posts`.`id` desc limit 20 offset 0
---
    public function getPostByUserID(Request $request){
        try{
            $validator = Validator::make($request->all(), [
                 'user_id' => ['required'],
                 'page' => ['required'],
                 'limit' => ['required'],
            ]);
            if ($validator->fails()) {
                return response()->json(['status'=>false,'message' => $validator->messages()->first()], 200);
            }


            $allimg[] = '';
            //$imgArr = '';
            $response = [];
            $basepath = url('/post/');
            $newlikeCounts =0;
            if(!empty($request->self_id)){
              $getAllPosts = Post::select('posts.*','posts.id as post_id','posts.user_id as user_id','users.name','users.name','users.email','users.phone','users.address','users.role','users.active','users.follower_count','users.image as user_image','posts.created_at as post_created_at')
                           ->leftJoin('users', 'users.id', '=', 'posts.user_id')
                           ->where('posts.user_id',$request->self_id)
                           ->latest('posts.id')->paginate($request->limit);
            }else{
                \DB::enableQueryLog();
               $getAllPosts =Post::select('follow_unfollows.status as follow_status', 'follow_unfollows.post_id', 'master_cities.city_name as location_name', 'posts.*', 'users.name', 'users.email', 'users.phone', 'users.address', 'users.role', 'users.active', 'users.follower_count', 'users.image as user_image', 'posts.created_at as post_created_at')
                           ->leftJoin('users', 'users.id', '=', 'posts.user_id')
                           ->leftJoin('follow_unfollows', 'follow_unfollows.follower_id', '=', 'posts.user_id')
                           ->leftJoin('follow_unfollows as new_follow_tb', 'new_follow_tb.user_id', '=', 'posts.user_id')
                           ->leftJoin('master_cities', 'master_cities.id', '=', 'posts.location')
                           ->where(function($query) use ($request){
                             $query->orWhere('follow_unfollows.status',1);
                             $query->orWhere('new_follow_tb.status',1);
                            })
                           ->where(function ($query) use ($request){
                             $query->orWhere(['follow_unfollows.user_id' => $request->user_id]);
                             $query->orWhere(['follow_unfollows.follower_id' => $request->user_id]);
                              $query->orWhere(['new_follow_tb.user_id' => $request->user_id]);
                             $query->orWhere(['new_follow_tb.follower_id' => $request->user_id]);
                           })
                           ->orWhere('posts.user_id', $request->user_id)
                           ->groupBy('posts.id')
                           ->latest('posts.id')->paginate($request->limit);

select count(*) as aggregate from `follow_unfollows` where (`user_id` = '167' and `post_id` = 2 and `type` = 1)
---
            }
            $videoThumnail =  $basepath.'/thumbnail.png';
            foreach($getAllPosts as $gtpost){
                $likeCounts = DB::table('follow_unfollows')->where(['user_id'=> $gtpost->user_id,'post_id'=> $gtpost->id,'type' => 1])->count();

select count(*) as aggregate from `comments` where (`post_id` = 2)
---
                else{
                    $newlikeCounts = $likeCounts;
                }
                $commentCount = Comment::where(['post_id'=>
                    $gtpost->id])->count();

select `users`.`id`, `users`.`place`, `users`.`name`, `users`.`email`, `users`.`image`, `users`.`address`, `users`.`phone`, `users`.`business_name`, `users`.`created_at` from `users` where `role` = 2 and `id` != '167'
---
    public function listOfFriend(Request $request){
        try{
            $validator = Validator::make($request->all(), [
                'user_id' => ['required'],
            ]);
            if ($validator->fails()) {
                return response()->json(['status'=>false,'message' => $validator->messages()->first()], 200);
            }
            $search = $request->search;
            $query = DB::table('users')->select('users.id','users.place','users.name','users.email','users.image','users.address','users.phone','users.business_name','users.created_at');
            if(!empty($search)){
               $query->where('name', 'like', $search. '%');
            }else{
                $query->where('role','=',2);
            }
            $query->where('id','!=',$request->user_id);
            $friendList = $query->get();

select count(*) as aggregate from `follow_unfollows` where (`follow_unfollows`.`follower_id` = '167' and `type` = 0)
select count(*) as aggregate from `follow_unfollows` where (`follow_unfollows`.`follower_id` = '167' and `type` = 0 and `status` = 1)
---
function getCountOfFollowerAndFollowing($type , $user_id){
    if($type == 1){
         $data = DB::table('follow_unfollows')->where(['follow_unfollows.follower_id'=> $user_id,                     'type' => 0])->count();
        return $data;
    }
    else{
       $data = DB::table('follow_unfollows')->where(['follow_unfollows.follower_id'=> $user_id,                      'type' => 0,'status' => 1])->count();