app/Http/Controllers/FeedController.php

select `posts`.`id`, `posts`.`image`, `posts`.`video`, `posts`.`status`, `posts`.`created_at`, `users`.`name` as `user_name`, `users`.`id` as `user_id` from `posts` left join `users` on `users`.`id` = `posts`.`user_id` order by `posts`.`id` desc limit 10 offset 0
select count(*) as aggregate from `posts` left join `users` on `users`.`id` = `posts`.`user_id`
---
	public function index(Request $request){
		try{
			if($request->is_ajax){
			if($request->search){
				$searchData = DB::table('posts')->select('posts.id','posts.image','posts.video','posts.status','posts.created_at', 'users.name as user_name','users.id as user_id')
                              ->leftJoin('users', 'users.id', '=', 'posts.user_id')
                              ->where('users.name', 'LIKE', '%' . $request->search  . '%')->paginate(10)->appends([
							    'search' => $request->search,
							]);
			}
			else{
				$searchData = DB::table('posts')->select('posts.id','posts.image','posts.video','posts.status','posts.created_at', 'users.name as user_name','users.id as user_id')
                              ->leftJoin('users', 'users.id', '=', 'posts.user_id')->paginate(10)->appends([
							    'search' => '',
							]);
			}

               $view = view('feeds.searchList', ['searchData' => $searchData])->render();
               return response()->json(
                [
                    'html' => $view,
                    'link' =>  $searchData->links()->render()
                ]
               );
            }
			$getAllFeeds = DB::table('posts')->select('posts.id','posts.image','posts.video','posts.status','posts.created_at','users.name as user_name','users.id as user_id')
                                 ->leftJoin('users', 'users.id', '=', 'posts.user_id')
                                 ->orderBy('posts.id','desc')
                                 ->paginate(10)->appends([
							    'search' => '',
							]);